
print('Задача 4. Площадь треугольника')

# Напишите программу,
# которая запрашивает у пользователя длины двух катетов
# в прямоугольном треугольнике и выводит его площадь.

# Формула: 
# S = ab/2

a = int(input('Введите 1ю длину:'))
b = int(input('Введите 2ю длину:'))

S = (a*b) / 2
print(S)